{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Project, Room, Product, Task, Moodboard, Document, ShoppingList, ProductLibrary, Material) with comparison modules and integrating AccessControl and MixinAuthorization for role-based access.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to debugging infinite loading states, verifying profile loading hook behavior, and adding error boundary/timeout logic to the profile loading flow.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of five frontend files covering App.tsx, ProfileSetupModal, useGetCallerUserProfile hook, ProfileLoadingError component, and LoginButton component.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, sidebar, charts, and borders.",
  "frontend/index.html": "HTML entry point for the React application with a root div and module script loading main.tsx, titled 'Shop List'.",
  "frontend/src/App.tsx": "Main React application component managing authentication flow, profile loading with timeout detection, error handling, routing setup with TanStack Router, and conditional rendering for landing page, profile setup modal, and authenticated layout.",
  "frontend/src/components/AddRoomModal.tsx": "Modal dialog component for adding a new room to a project with form fields for name, area, category, budget, and notes, using the useAddRoom mutation hook.",
  "frontend/src/components/AddShoppingListModal.tsx": "Modal dialog component for creating a new shopping list with fields for name, shop/supplier, and discount percentage, using the useAddShoppingList mutation hook.",
  "frontend/src/components/AddTaskModal.tsx": "Modal dialog component for creating new tasks with fields for title, description, deadline, type, and assignment. Uses useAddTask hook to submit task data and resets form on success.",
  "frontend/src/components/BudgetProgressBar.tsx": "Card component displaying a visual progress bar for budget usage with percentage indicator. Color changes based on budget threshold (red at 100%, yellow at 80%, blue otherwise).",
  "frontend/src/components/BudgetSummaryCard.tsx": "Comprehensive budget overview card showing total budget, spent amount, usage percentage with progress bar, and remaining/over-budget status with appropriate icons and styling.",
  "frontend/src/components/CategoryBudgetBreakdown.tsx": "Card component that displays budget breakdown by product categories using calculateCategoryBudgets utility. Shows each category with its total amount or empty state message.",
  "frontend/src/components/ClientCard.tsx": "Card component displaying client profile information including name, role, contact details (email, phone, company), and project count. Shows avatar with client's initial.",
  "frontend/src/components/CreateProjectModal.tsx": "Modal dialog for creating new projects with form fields for name, client ID, timeline, and budget. Uses useAddProject hook and resets form on successful submission.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header, navigation menu (different for clients vs. other roles), user profile display, logout functionality, and mobile-responsive sheet menu.",
  "frontend/src/components/LibraryProductCard.tsx": "Card component for displaying product library items with image, name, shop, description, price, type badge, and a button to copy the product to a project.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles login/logout using Internet Identity. Shows loading state during authentication and clears query cache on logout.",
  "frontend/src/components/LogisticsProductCard.tsx": "Compact card component for displaying product information in logistics view, showing thumbnail image, name, shop, quantity, and price in a condensed layout.",
  "frontend/src/components/LogisticsStatusColumn.tsx": "Displays a card column for logistics status with a title, product count, and a list of LogisticsProductCard components or an empty state message.",
  "frontend/src/components/MoodboardCard.tsx": "Renders a moodboard card showing name, description, up to 4 images in a grid, linked product count, and total cost.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, status badge, shop, price, quantity, availability, and an external link to view the product.",
  "frontend/src/components/ProfileLoadingError.tsx": "Shows an error alert when profile loading fails with retry and login options, including specific messaging for timeout errors.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible modal dialog for new users to complete their profile with name, email, phone, company, and role fields.",
  "frontend/src/components/ProjectCard.tsx": "Displays a clickable project card with budget status, client ID, timeline, budget progress bar, and room count, linking to the project detail page.",
  "frontend/src/components/RoomBudgetList.tsx": "Shows a list of rooms with their budgets and spent amounts, or an empty state if no rooms exist in the project.",
  "frontend/src/components/RoomCard.tsx": "Displays room details including area, budget, spent amount, and an expandable list of products associated with the room.",
  "frontend/src/components/SharedProjectView.tsx": "Renders a read-only view of a project showing name, timeline, budget, and rooms list for shared access.",
  "frontend/src/components/ShoppingListCard.tsx": "Displays a shopping list card with shop name, status, total, discount, and an expandable grid of product cards.",
  "frontend/src/components/TaskCard.tsx": "Displays a single task in a card format with title, description, deadline, assignee, and type badge. Highlights overdue tasks with a destructive border and alert icon.",
  "frontend/src/components/TaskKanbanBoard.tsx": "Renders a three-column Kanban board organizing tasks by status (pending, in progress, completed). Each column displays task count and contains TaskCard components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAddProject.ts": "Mutation hook for adding a new project with details like name, client, timeline, budget, status, and rooms. Invalidates 'myProjects' query on success.",
  "frontend/src/hooks/useAddRoom.ts": "Mutation hook for adding a room to a project with properties like name, area, notes, category, budget, and products. Invalidates project and myProjects queries on success.",
  "frontend/src/hooks/useAddShoppingList.ts": "Mutation hook for creating a shopping list with name, total, discount, shop, products, and status. Invalidates 'shoppingLists' query on success.",
  "frontend/src/hooks/useAddTask.ts": "Mutation hook for adding a task with title, description, status, deadline, project/room IDs, type, and assignee. Invalidates project-specific tasks query on success.",
  "frontend/src/hooks/useAddToProductLibrary.ts": "Mutation hook for adding a product to the library with name, image, price, shop, description, and type. Invalidates 'productLibrary' query on success.",
  "frontend/src/hooks/useGetAllTasks.ts": "Query hook that fetches all tasks for a specific project by ID. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useGetAllUsersData.ts": "Query hook that retrieves data for all users in the system. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile with custom loading states and 5-minute stale time. Properly handles actor dependency for loading state.",
  "frontend/src/hooks/useGetMoodboards.ts": "Query hook that fetches moodboards for a specific project by filtering all user data. Enabled only when actor is available.",
  "frontend/src/hooks/useGetMyProjects.ts": "Query hook that retrieves all projects belonging to the current user. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useGetProductLibrary.ts": "Query hook that fetches the complete product library. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useGetProject.ts": "Query hook that retrieves a single project by its ID. Returns null if not found and is enabled only when actor is available.",
  "frontend/src/hooks/useGetShoppingLists.ts": "Query hook that fetches all shopping lists for the current user. Enabled only when actor is available and not fetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking. Creates AuthClient with configurable options and handles identity persistence across page reloads.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook for saving the current user's profile. Invalidates 'currentUserProfile' query on success.",
  "frontend/src/hooks/useShareProjectWithClient.ts": "Mutation hook for sharing a project with a client using their Principal ID. Invalidates project and myProjects queries on success.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a warm earth-tone color palette in both light and dark modes. Includes chart colors and design tokens for consistent theming.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/BudgetOverviewPage.tsx": "Displays a comprehensive budget overview for a project, including total budget, spent, and remaining amounts with progress bars, category breakdowns, and over-budget alerts.",
  "frontend/src/pages/ClientPortalPage.tsx": "Client-only portal page that displays all projects shared with the logged-in client user using SharedProjectView components.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all users with 'client' role in a grid of ClientCard components, allowing designers to manage client relationships.",
  "frontend/src/pages/LogisticsPage.tsx": "Displays a kanban-style logistics tracking board with five status columns (planned, ordered, in transit, delivered, installed) showing products from all shopping lists.",
  "frontend/src/pages/MoodboardsPage.tsx": "Lists all moodboards for a project in a grid layout with a create button, showing visual inspiration boards linked to products.",
  "frontend/src/pages/ProductLibraryPage.tsx": "Displays a searchable grid of reusable products from the product library with add functionality for managing frequently used items.",
  "frontend/src/pages/ProjectDashboardPage.tsx": "Main project dashboard showing budget summary, quick action buttons for rooms/tasks/moodboards/logistics, and room budget breakdown.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects in a searchable grid with create project functionality, serving as the main projects overview page.",
  "frontend/src/pages/RoomsPage.tsx": "Displays all rooms for a project in a grid layout with add room functionality for organizing products and costs by room.",
  "frontend/src/pages/ShoppingListPage.tsx": "React page component that displays all shopping lists with loading state, empty state, and a modal to add new lists. Uses useGetShoppingLists hook and renders ShoppingListCard components for each list.",
  "frontend/src/pages/TasksPage.tsx": "React page component for project tasks that displays a Kanban board view with back navigation, loading state, and an add task modal. Uses useGetAllTasks hook and extracts projectId from route params.",
  "frontend/src/utils/budgetCalculations.ts": "Utility functions for calculating project budget metrics including total spent across rooms/products, per-room budgets with spent amounts, category-based spending breakdowns, and budget utilization percentages.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar colors, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking an interior design management app with a known issue of infinite loading state on user profile, three existing features addressing the loading bug, and one pending backend fix request."
}