{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Project, Room, Product, Task, Moodboard, Document, ShoppingList, ProductLibrary, Material) with CRUD operations, role-based access control, and authorization mixins for an interior design project management system.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (project dashboard, shopping lists, room management, budget overview, task management) to their corresponding frontend files, components, and test IDs with confidence levels.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, cards, sidebars, and charts using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the React application with a root div and module script loading main.tsx, titled 'Shop List'.",
  "frontend/src/App.tsx": "Main React application component setting up TanStack Router with routes for projects, rooms, shopping lists, budget, tasks, moodboards, logistics, clients, product library, and client portal, with authentication and profile setup handling.",
  "frontend/src/components/AddRoomModal.tsx": "Modal dialog component for adding new rooms to a project with form fields for name, area, category, budget, and notes, using the useAddRoom hook for submission.",
  "frontend/src/components/AddShoppingListModal.tsx": "Modal dialog component for creating new shopping lists with fields for list name, shop/supplier, and discount percentage, using the useAddShoppingList hook for submission.",
  "frontend/src/components/AddTaskModal.tsx": "Modal dialog component for creating new tasks with fields for title, description, deadline, type, and assignment, using React Hook Form and the useAddTask mutation hook.",
  "frontend/src/components/BudgetProgressBar.tsx": "Card component displaying a visual progress bar for budget usage with percentage calculation and color-coded indicators (green/yellow/red based on spending thresholds).",
  "frontend/src/components/BudgetSummaryCard.tsx": "Card component showing comprehensive budget overview including total budget, spent amount, usage percentage with progress bar, and remaining/over-budget status with appropriate icons.",
  "frontend/src/components/CategoryBudgetBreakdown.tsx": "Card component that displays budget spending broken down by product categories, calculated from project data using the calculateCategoryBudgets utility.",
  "frontend/src/components/ClientCard.tsx": "Card component displaying client profile information including name, role, contact details (email, phone, company), and project count with appropriate icons.",
  "frontend/src/components/CreateProjectModal.tsx": "Modal dialog for creating new projects with form fields for name, client ID, timeline, and budget, using the useAddProject mutation hook.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, navigation menu (role-based for clients vs designers), user profile display, logout functionality, and responsive mobile menu.",
  "frontend/src/components/LibraryProductCard.tsx": "Card component for displaying product library items with image, name, shop, description, price, type badge, and a button to copy the product to a project.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/LogisticsProductCard.tsx": "Compact card component displaying product information for logistics view including thumbnail, name, shop, quantity, and price.",
  "frontend/src/components/LogisticsStatusColumn.tsx": "Card component representing a logistics status column (e.g., ordered, in-transit) containing a list of LogisticsProductCard components with item count.",
  "frontend/src/components/MoodboardCard.tsx": "Displays a moodboard card with name, description, up to 4 images in a grid, linked product count, and total cost.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card showing image, name, status badge, shop, price, quantity, availability, and external link.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup with fields for name, email, phone, company, and role selection.",
  "frontend/src/components/ProjectCard.tsx": "Clickable project card displaying name, client ID, timeline, budget progress bar with status badge, and room count.",
  "frontend/src/components/RoomBudgetList.tsx": "Lists all rooms in a project with their category, spent amount, and budget in a card layout.",
  "frontend/src/components/RoomCard.tsx": "Expandable room card showing area, budget, spent amount, notes, and collapsible product list.",
  "frontend/src/components/SharedProjectView.tsx": "Read-only project view for clients showing project name, timeline, budget, and room list.",
  "frontend/src/components/ShoppingListCard.tsx": "Shopping list card with shop name, status, total/discount/product count, and expandable product grid.",
  "frontend/src/components/TaskCard.tsx": "Task card displaying title, description, deadline with overdue indicator, assignee, and task type badge.",
  "frontend/src/components/TaskKanbanBoard.tsx": "Kanban board organizing tasks into three columns (pending, in progress, completed) with task counts.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAddProject.ts": "React mutation hook for adding a new project with details like name, client, timeline, budget, status, and rooms, invalidating the projects query cache on success.",
  "frontend/src/hooks/useAddRoom.ts": "React mutation hook for adding a room to a project with properties like name, area, notes, category, budget, and products, invalidating related project queries on success.",
  "frontend/src/hooks/useAddShoppingList.ts": "React mutation hook for creating a shopping list with name, total, discount, shop, products, and status, invalidating the shopping lists query cache on success.",
  "frontend/src/hooks/useAddTask.ts": "React mutation hook for adding a task with title, description, status, deadline, project/room IDs, type, and assignment, invalidating the tasks query for the specific project on success.",
  "frontend/src/hooks/useAddToProductLibrary.ts": "React mutation hook for adding a product to the library with details like name, image, price, shop, description, and type, invalidating the product library query on success.",
  "frontend/src/hooks/useGetAllTasks.ts": "React query hook that fetches all tasks for a specific project by ID, enabled only when the actor is available and not fetching.",
  "frontend/src/hooks/useGetAllUsersData.ts": "React query hook that fetches data for all users from the backend, enabled only when the actor is available.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React query hook that fetches the current authenticated user's profile, with loading state tracking both actor initialization and query execution.",
  "frontend/src/hooks/useGetMoodboards.ts": "React query hook that fetches all moodboards for a specific project by filtering user data moodboards by project ID.",
  "frontend/src/hooks/useGetMyProjects.ts": "React query hook that fetches all projects belonging to the current user, enabled only when the actor is available.",
  "frontend/src/hooks/useGetProductLibrary.ts": "React query hook that fetches the product library from the backend, enabled only when the actor is available.",
  "frontend/src/hooks/useGetProject.ts": "React query hook that fetches a single project by its ID, returning null if not found, enabled only when the actor is available.",
  "frontend/src/hooks/useGetShoppingLists.ts": "React query hook that fetches all shopping lists from the backend, enabled only when the actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React mutation hook for saving the current user's profile, invalidating the user profile query cache on success.",
  "frontend/src/hooks/useShareProjectWithClient.ts": "React mutation hook for sharing a project with a client by their Principal ID, invalidating both the specific project and projects list queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-tone color palette for light and dark themes, including primary browns, beige secondaries, and terracotta accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component into the DOM.",
  "frontend/src/pages/BudgetOverviewPage.tsx": "Page component displaying project budget overview with total/spent/remaining cards, progress bar, over-budget alerts, and category breakdown using budget calculation utilities.",
  "frontend/src/pages/ClientPortalPage.tsx": "Displays a client-only portal showing projects shared with the logged-in client user. Restricts access to non-client roles and shows a loading or empty state when appropriate.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all users with the 'client' role in a grid of ClientCard components. Shows loading spinner or empty state when no clients exist.",
  "frontend/src/pages/LogisticsPage.tsx": "Displays a kanban-style logistics tracking board with five status columns (planned, ordered, in transit, delivered, installed) showing products from all shopping lists.",
  "frontend/src/pages/MoodboardsPage.tsx": "Shows all moodboards for a specific project with options to create new ones. Includes back navigation to the project and displays empty state when no moodboards exist.",
  "frontend/src/pages/ProductLibraryPage.tsx": "Displays a searchable grid of reusable products from the product library with an option to add new products. Shows empty state when library is empty.",
  "frontend/src/pages/ProjectDashboardPage.tsx": "Main project overview page showing budget summary, quick action links to rooms/tasks/moodboards/shopping lists, and room budget breakdown. Includes back navigation to projects list.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects for the current user in a searchable grid with a modal to create new projects. Shows empty state with call-to-action when no projects exist.",
  "frontend/src/pages/RoomsPage.tsx": "Displays all rooms within a project in a grid layout with modal to add new rooms. Shows empty state when no rooms exist and includes back navigation to project dashboard.",
  "frontend/src/pages/ShoppingListPage.tsx": "Lists all shopping lists with modal to create new ones. Shows loading spinner or empty state with call-to-action when no lists exist.",
  "frontend/src/pages/TasksPage.tsx": "Displays project tasks in a kanban board layout with modal to add new tasks. Includes back navigation to project dashboard and shows loading state during data fetch.",
  "frontend/src/utils/budgetCalculations.ts": "Provides utility functions for calculating project budgets including total spent, per-room budgets, category-based spending, and budget percentage calculations using BigInt for precision.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing Shop List as an interior design ERP/BI SaaS with microservices-ready architecture using FastAPI backend, React frontend, PostgreSQL database, and comprehensive feature list for project management, budgets, shopping lists, and client portals."
}