{
  "backend/main.mo": "Main Motoko actor defining all data types (UserProfile, Project, Room, Product, Task, Moodboard, Document, ShoppingList, ProductLibrary, Material) with comparison functions and role-based access control integration.",
  "feature_evidence.json": "Feature evidence report mapping three authentication and profile setup requirements to their implementation files (App.tsx, ProfileSetupModal.tsx) with high confidence.",
  "frontend-file-summaries.txt": "JSON summary of two frontend files: App.tsx (main routing and auth flow) and ProfileSetupModal.tsx (mandatory first-time user profile setup).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, sidebar, charts, and borders.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Shop List application.",
  "frontend/src/App.tsx": "Main React app with TanStack Router, authentication flow using Internet Identity, conditional rendering for login/profile setup/authenticated routes, and loading states for all pages.",
  "frontend/src/components/AddRoomModal.tsx": "Dialog modal component for adding a new room to a project with form fields for name, area, category, budget, and notes using useAddRoom hook.",
  "frontend/src/components/AddShoppingListModal.tsx": "Dialog modal component for creating a new shopping list with fields for name, shop/supplier, and discount percentage using useAddShoppingList hook.",
  "frontend/src/components/AddTaskModal.tsx": "Modal dialog component for creating new tasks with fields for title, description, deadline, type (design/ordering/realization), and assignment. Uses useAddTask hook to submit task data to the backend.",
  "frontend/src/components/BudgetProgressBar.tsx": "Card component displaying a visual progress bar for budget usage with percentage and color-coded indicators (green/yellow/red based on spending thresholds).",
  "frontend/src/components/BudgetSummaryCard.tsx": "Card component showing comprehensive budget overview including total budget, total spent, usage percentage with progress bar, and remaining/over-budget status with appropriate icons and styling.",
  "frontend/src/components/CategoryBudgetBreakdown.tsx": "Card component that displays budget spending broken down by product categories using calculateCategoryBudgets utility function.",
  "frontend/src/components/ClientCard.tsx": "Card component displaying client profile information including name, role, contact details (email, phone, company), and project count from AllUserData.",
  "frontend/src/components/CreateProjectModal.tsx": "Modal dialog for creating new projects with fields for name, client ID, timeline, and budget. Uses useAddProject hook to submit project data.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, role-based menu items (different for clients vs. designers), user profile display, and logout functionality. Includes responsive mobile menu.",
  "frontend/src/components/LibraryProductCard.tsx": "Card component for displaying product library items with image, name, shop, description, price, type badge, and a button to copy the product to a project.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout using useInternetIdentity hook and clears query cache on logout.",
  "frontend/src/components/LogisticsProductCard.tsx": "Compact card component displaying product information for logistics view including thumbnail, name, shop, quantity, and price.",
  "frontend/src/components/LogisticsStatusColumn.tsx": "Card component that groups and displays products by logistics status, showing status title, product count, and list of LogisticsProductCard components.",
  "frontend/src/components/MoodboardCard.tsx": "Displays a moodboard card with name, description, up to 4 images in a grid, linked product count, and total cost.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card showing image, name, status badge, shop, price, quantity, availability, and external link.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for initial user profile setup requiring name, email, and role, with optional phone and company fields.",
  "frontend/src/components/ProjectCard.tsx": "Clickable project card displaying name, client, timeline, budget progress bar with status badge, and room count.",
  "frontend/src/components/RoomBudgetList.tsx": "Lists all rooms in a project with their category, spent amount, and budget in a card layout.",
  "frontend/src/components/RoomCard.tsx": "Expandable room card showing area, budget, spent amount, and collapsible product list with details.",
  "frontend/src/components/SharedProjectView.tsx": "Read-only project view for clients showing project name, timeline, budget, and room list.",
  "frontend/src/components/ShoppingListCard.tsx": "Shopping list card with shop name, status, total/discount/product count, and expandable product grid.",
  "frontend/src/components/TaskCard.tsx": "Task card displaying title, description, deadline with overdue indicator, assignee, and task type badge.",
  "frontend/src/components/TaskKanbanBoard.tsx": "Kanban board organizing tasks into three columns (pending, in progress, completed) with task counts.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useAddProject.ts": "React Query mutation hook for adding a new project with details like name, client, timeline, budget, status, and rooms, invalidating the projects query cache on success.",
  "frontend/src/hooks/useAddRoom.ts": "React Query mutation hook for adding a room to a project with properties like name, area, notes, category, budget, and products, invalidating related project queries on success.",
  "frontend/src/hooks/useAddShoppingList.ts": "React Query mutation hook for creating a shopping list with name, total, discount, shop, products, and status, invalidating the shopping lists cache on success.",
  "frontend/src/hooks/useAddTask.ts": "React Query mutation hook for adding a task with title, description, status, deadline, project/room IDs, type, and assignment, invalidating the tasks query for the project on success.",
  "frontend/src/hooks/useAddToProductLibrary.ts": "React Query mutation hook for adding a product to the library with details like name, image, price, shop, description, and type, invalidating the product library cache on success.",
  "frontend/src/hooks/useGetAllTasks.ts": "React Query hook that fetches all tasks for a specific project, enabled only when the actor is available and not fetching.",
  "frontend/src/hooks/useGetAllUsersData.ts": "React Query hook that retrieves data for all users in the system, enabled when the actor is ready.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile, with loading state tracking both actor initialization and query execution.",
  "frontend/src/hooks/useGetMoodboards.ts": "React Query hook that fetches moodboards for a specific project by filtering all user data moodboards by project ID.",
  "frontend/src/hooks/useGetMyProjects.ts": "React Query hook that retrieves all projects belonging to the current user, enabled when the actor is available.",
  "frontend/src/hooks/useGetProductLibrary.ts": "React Query hook that fetches the product library catalog, enabled when the actor is ready.",
  "frontend/src/hooks/useGetProject.ts": "React Query hook that retrieves a single project by its ID, returning null if not found.",
  "frontend/src/hooks/useGetShoppingLists.ts": "React Query hook that fetches all shopping lists for the current user, enabled when the actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile, invalidating the user profile cache on success.",
  "frontend/src/hooks/useShareProjectWithClient.ts": "React Query mutation hook for sharing a project with a client using their Principal ID, invalidating project and projects list queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette for light and dark modes, including primary browns, beige secondaries, and terracotta accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BudgetOverviewPage.tsx": "Page component displaying project budget overview with total/spent/remaining cards, progress bar, over-budget alerts, and category breakdown using budget calculation utilities.",
  "frontend/src/pages/ClientPortalPage.tsx": "Displays a client-only portal page showing projects shared with the logged-in client user, with loading states and access restrictions for non-client roles.",
  "frontend/src/pages/ClientsPage.tsx": "Lists all users with the 'client' role in a grid of ClientCard components, with loading and empty states.",
  "frontend/src/pages/LogisticsPage.tsx": "Displays a logistics tracking dashboard with products from all shopping lists organized into five status columns (planned, ordered, in transit, delivered, installed).",
  "frontend/src/pages/MoodboardsPage.tsx": "Shows all moodboards for a specific project with options to create new moodboards and navigate back to the project.",
  "frontend/src/pages/ProductLibraryPage.tsx": "Displays a searchable grid of reusable products from the product library with an option to add new products.",
  "frontend/src/pages/ProjectDashboardPage.tsx": "Main project dashboard showing budget summary, quick action links to rooms/tasks/moodboards/shopping lists, and room budget breakdown for a specific project.",
  "frontend/src/pages/ProjectsPage.tsx": "Lists all projects for the current user in a searchable grid with a modal to create new projects.",
  "frontend/src/pages/RoomsPage.tsx": "Displays all rooms for a specific project in a grid with a modal to add new rooms.",
  "frontend/src/pages/ShoppingListPage.tsx": "Lists all shopping lists with a modal to create new lists, showing empty state when no lists exist.",
  "frontend/src/pages/TasksPage.tsx": "Displays a Kanban board of tasks for a specific project with a modal to add new tasks.",
  "frontend/src/utils/budgetCalculations.ts": "Provides utility functions for calculating project budgets, including total spent across all rooms, per-room budget tracking, category-based spending aggregation, and budget percentage calculations using BigInt for precision.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color variables for theming (including dark mode), custom animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking an interior design management app with authentication issues where users are stuck on the sign-in page and cannot access main features like projects, rooms, shopping lists, and tasks."
}