{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix authentication flow - enable app access after sign-in",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the authentication flow so users can successfully sign in with Internet Identity and access the main application features instead of being stuck on the landing page",
      "acceptanceCriteria": [
        "After clicking sign in and completing Internet Identity authentication, user is redirected to the main app interface",
        "User can see and access the main navigation menu (Projects, Shopping Lists, Tasks, etc.)",
        "The landing/sign-in page is no longer displayed after successful authentication",
        "User profile data is properly loaded after authentication",
        "First-time users are prompted to complete profile setup before accessing main features"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the authentication flow by ensuring that after successful Internet Identity sign-in, the application properly transitions from the landing page to the main application interface. Update the conditional rendering logic to check authentication state and profile loading status correctly. Ensure that authenticated users with completed profiles are immediately shown the Layout component with main navigation instead of remaining on the landing page. Add proper state management to handle the transition from unauthenticated to authenticated state, including waiting for profile data to load before determining whether to show the profile setup modal or main app interface."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Ensure the Layout component renders correctly after authentication state changes from unauthenticated to authenticated. Verify that the header, navigation menu, and user profile information display properly once the user is authenticated and has a completed profile. Check that all navigation links work correctly and that the component doesn't have any blocking conditions that prevent it from rendering after sign-in."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the ProfileSetupModal appears automatically for new users who have not completed their profile, and blocks access to main features until profile setup is complete",
      "acceptanceCriteria": [
        "ProfileSetupModal displays automatically after first-time Internet Identity sign-in",
        "Modal cannot be dismissed until user completes all required fields (name, email, role)",
        "After profile setup completion, user is redirected to the main application interface",
        "Returning users with completed profiles skip the setup modal entirely"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Ensure the ProfileSetupModal properly blocks user access to main features until profile setup is complete by making it non-dismissible. Verify that all required fields (name, email, role) must be filled before submission is allowed. After successful profile submission via useSaveCallerUserProfile, ensure the modal closes and the user is immediately shown the main application interface. Add proper form validation to prevent submission with incomplete data."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the logic that determines when to show the ProfileSetupModal. Use the pattern from the authorization component usage: `const showProfileSetup = isAuthenticated && !profileLoading && isFetched && userProfile === null;`. Ensure the modal displays automatically for authenticated users without a profile, blocks access to the main Layout until profile is saved, and that returning users with completed profiles bypass the modal entirely and go straight to the main app interface."
        },
        {
          "path": "frontend/src/hooks/useGetCallerUserProfile.ts",
          "operation": "modify",
          "description": "Verify the hook implementation follows the authorization component pattern to prevent profile setup modal flash. Ensure it returns custom state with `isLoading: actorFetching || query.isLoading` and `isFetched: !!actor && query.isFetched` to properly coordinate the actor dependency with query state. This prevents the modal from appearing prematurely before the actor is ready."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Verify that the Layout component and main application routes render correctly after authentication state changes from unauthenticated to authenticated",
      "acceptanceCriteria": [
        "Layout component with header, navigation, and main content area renders after sign-in",
        "Route navigation works correctly (clicking menu items navigates to correct pages)",
        "User profile information displays in the header/navigation",
        "No console errors related to authentication or routing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Verify that the Layout component correctly handles the authentication state transition and renders all child components (header, navigation, main content) properly after a user successfully signs in. Check that the user profile information from useGetCallerUserProfile displays correctly in the header/navigation area. Ensure no blocking conditions or missing data checks prevent the Layout from rendering after authentication. Add console logging if needed to debug any rendering issues during the authentication flow transition."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify that the TanStack Router properly initializes and renders routes after authentication state changes. Ensure that route components (Projects, Shopping Lists, Tasks, etc.) are accessible and render correctly once the user is authenticated and has completed profile setup. Check that navigation between routes works smoothly without errors. Verify that the router context is properly set up and that all route links function correctly after sign-in."
        }
      ]
    }
  ]
}